// // Home.js

// import React from 'react';
// import { Link } from 'react-router-dom';
// import './Home.scss';

// function Home() {
//   return (
//     <div className="home">
        
//         <div className="head">
//             <h1 className="head__text">Hoops Haven</h1>
//         </div>

//         <section className="news-section">
//             <div className="news-card">
//                 <img src="./img/news_image_1.jpg" alt="Зображення новини 1" />
//                 <div className="news-content">
//                     <h3>Вивчаємо основи баскетболу: Перший крок до гри</h3>
//                     <p>Баскетбол - це захоплююча командна гра, яка вимагає навичок, спритності та співпраці. Для тих, хто тільки починає вивчати баскетбол, освоєння основ - перший крок до успішної гри.</p>
//                     <p>Дриблінг - це навичка контролю м'яча, коли ви відбиваєте його від підлоги і пересуваєтеся по майданчику. Правильний дриблінг вимагає контролю та координації. Вправляйтесь в дриблінгу, тримаючи м'яч однією рукою, а потім іншою. Виконуйте це, не відволікаючись від гри. Поступово підвищуйте складність ваших рухів та дриблінгу на різних швидкостях.</p>
//                     <p>В баскетболі важливо розуміти загальну тактику гри. Навчіться, як розміщати гравців на майданчику, комунікувати з партнерами по команді та вибирати правильні моменти для проходження та забиття м'яча. Працюйте над своєю грою в команді та розвивайте чуйність до гри.</p>
//                 </div>
//             </div>

//             <div className="news-card">
//                 <img src="./img/news_image_2.jpg" alt="Зображення новини 2" />
//                 <div className="news-content">
//                     <h3>Топ-4 великих баскетболістів у історії</h3>
//                     <p>Баскетбол завжди був спортом, який виробляє легенди. Ось п'ятеро великих баскетболістів, які залишили незабутні сліди в історії гри:</p>
//                     <p>1. Майкл Джордан вважається одним із найкращих баскетболістів усіх часів. Він виграв 6 чемпіонатів NBA зі своєю командою Chicago Bulls та 5 разів ставав найкращим бомбардиром. Його неймовірна майстерність та рішучість роблять його справжньою легендою.</p>
//                     <p>2. Леброн Джеймс є сучасною іконою баскетболу. Він здобув чотири титули NBA і був обраний МВП фіналу чотири рази. Його унікальна комбінація розміру, швидкості та баскетбольних навичок роблять його одним із найкращих гравців свого покоління.</p>
//                     <p>3. Вільт Чемберлен був домінуючим гравцем в епоху 60-х років. Він встановив безліч рекордів, включаючи рекорд з 100 очок в одному матчі. Чемберлен завоював два чемпіонати NBA та був одним із найбільших центров у історії гри.</p>
//                     <p>4. Білл Рассел - легендарний центровий та переможець 11 чемпіонатів NBA. Він відзначався за відмінну захист та високий рівень співпраці з командою. Рассел вважається одним із найвпливовіших гравців у історії.</p>
//                 </div>
//             </div>
//         </section>

//         <section className="feedback-section">
//             <h2 className="feedback-title">Залиште своє повідомлення</h2>
//             <form>
//             <div className="form-group">
//                 <input type="text" id="name" name="name" required className="feedback-input" value="Ваше ім'я"/>
//             </div>
//             <div className="form-group">
//                 <input type="email" id="email" name="email" required className="feedback-input" value="Ваш Email"/>
//             </div>
//             <div className="form-group">
//                 <textarea id="message" name="message" required className="feedback-textarea" value="Повідомлення"/>
//             </div>
//             <button type="submit" className="feedback-btn">Відправити</button>
//             </form>
//         </section>
//     </div>
//   );
// }

// export default Home;
