import React from 'react';
import BlogArticle from './BlogArticle'; // Імпорт компоненту BlogArticle
import './Blog.scss';

function Blog() {
  const blogs = [
    {
      imgSrc:"./img/blog/blog1.jpg",
      title:"Вивчаємо основи баскетболу: Перший крок до гри",
      text:"Баскетбол - це захоплююча командна гра, яка вимагає навичок, спритності та співпраці. Для тих, хто тільки починає вивчати баскетбол, освоєння основ - перший крок до успішної гри. Дриблінг - це навичка контролю м'яча, коли ви відбиваєте його від підлоги і пересуваєтеся по майданчику. Правильний дриблінг вимагає контролю та координації. Вправляйтесь в дриблінгу, тримаючи м'яч однією рукою, а потім іншою. Виконуйте це, не відволікаючись від гри. Поступово підвищуйте складність ваших рухів та дриблінгу на різних швидкостях. В баскетболі важливо розуміти загальну тактику гри. Навчіться, як розміщати гравців на майданчику, комунікувати з партнерами по команді та вибирати правильні моменти для проходження та забиття м'яча. Працюйте над своєю грою в команді та розвивайте чуйність до гри."
    }, 
    {
      imgSrc:"./img/blog/blog2.jpg",
      title:"Топ-4 великих баскетболістів у історії",
      text:"Баскетбол завжди був спортом, який виробляє легенди. Ось п'ятеро великих баскетболістів, які залишили незабутні сліди в історії гри: 1. Майкл Джордан вважається одним із найкращих баскетболістів усіх часів. Він виграв 6 чемпіонатів NBA зі своєю командою Chicago Bulls та 5 разів ставав найкращим бомбардиром. Його неймовірна майстерність та рішучість роблять його справжньою легендою. 2. Леброн Джеймс є сучасною іконою баскетболу. Він здобув чотири титули NBA і був обраний МВП фіналу чотири рази. Його унікальна комбінація розміру, швидкості та баскетбольних навичок роблять його одним із найкращих гравців свого покоління. 3. Вільт Чемберлен був домінуючим гравцем в епоху 60-х років. Він встановив безліч рекордів, включаючи рекорд з 100 очок в одному матчі. Чемберлен завоював два чемпіонати NBA та був одним із найбільших центров у історії гри. 4. Білл Рассел - легендарний центровий та переможець 11 чемпіонатів NBA. Він відзначався за відмінну захист та високий рівень співпраці з командою. Рассел вважається одним із найвпливовіших гравців у історії."
    }
  ]

  return (
    <div className="blog">
      <div className="container">
        <h2 className='title'>Блог</h2>
          <div className="blog-wrapper">
            {blogs.map((blog, index) => (
              <BlogArticle {...blog} />
            ))}
          </div>
      </div>
    </div>
  );
}

export default Blog;