import React from 'react';
import Reads from './Reads';
import './Reads.scss';


const readsData = [
  {
    id: 1,
    title: 'Вивчаємо основи баскетболу: Перший крок до гри',
    description: 'Баскетбол - це захоплююча командна гра, яка вимагає навичок, спритності та співпраці. Для тих, хто тільки починає вивчати баскетбол, освоєння основ - перший крок до успішної гри. Баскетбол - це захоплююча командна гра, яка вимагає навичок, спритності та співпраці. Для тих, хто тільки починає вивчати баскетбол, освоєння основ - перший крок до успішної гри.Баскетбол - це захоплююча командна граБаскетбол - це захоплююча командна гра, яка вимагає навичок, спритності та співпраці. Для тих, хто тільки починає вивчати баскетбол, освоєння основ - перший крок до успішної гри.Баскетбол - це захоплююча командна граБаскетбол - це захоплююча командна гра, яка вимагає навичок, спритності та співпраці. Для тих, хто тільки починає вивчати баскетбол, освоєння основ - перший крок до успішної гри.Баскетбол - це захоплююча командна граБаскетбол - це захоплююча командна гра, яка вимагає навичок, спритності та співпраці. Для тих, хто тільки починає вивчати баскетбол, освоєння основ - перший крок до успішної гри.Баскетбол - це захоплююча командна граБаскетбол - це захоплююча командна гра, яка вимагає навичок, спритності та співпраці. Для тих, хто тільки починає вивчати баскетбол, освоєння основ - перший крок до успішної гри.Баскетбол - це захоплююча командна граБаскетбол - це захоплююча командна гра, яка вимагає навичок, спритності та співпраці. Для тих, хто тільки починає вивчати баскетбол, освоєння основ - перший крок до успішної гри.Баскетбол - це захоплююча командна граБаскетбол - це захоплююча командна гра, яка вимагає навичок, спритності та співпраці. Для тих, хто тільки починає вивчати баскетбол, освоєння основ - перший крок до успішної гри.Баскетбол - це захоплююча командна граБаскетбол - це захоплююча командна гра, яка вимагає навичок, спритності та співпраці. Для тих, хто тільки починає вивчати баскетбол, освоєння основ - перший крок до успішної гри.Баскетбол - це захоплююча командна граБаскетбол - це захоплююча командна гра, яка вимагає навичок, спритності та співпраці. Для тих, хто тільки починає вивчати баскетбол, освоєння основ - перший крок до успішної гри.Баскетбол - це захоплююча командна гра',
    image: 'img/blog/blog1.jpg',
  },
  {
    id: 2,
    title: 'Вивчаємо основи баскетболу: Перший крок до гри',
    description: 'Баскетбол - це захоплююча командна гра, яка вимагає навичок, спритності та співпраці. Для тих, хто тільки починає вивчати баскетбол, освоєння основ - перший крок до успішної гри.Баскетбол - це захоплююча командна граБаскетбол - це захоплююча командна гра, яка вимагає навичок, спритності та співпраці. Для тих, хто тільки починає вивчати баскетбол, освоєння основ - перший крок до успішної гри.Баскетбол - це захоплююча командна граБаскетбол - це захоплююча командна гра, яка вимагає навичок, спритності та співпраці. Для тих, хто тільки починає вивчати баскетбол, освоєння основ - перший крок до успішної гри.Баскетбол - це захоплююча командна гра Баскетбол - це захоплююча командна гра, яка вимагає навичок, спритності та співпраці. Для тих, хто тільки починає вивчати баскетбол, освоєння основ - перший крок до успішної гри.Баскетбол - це захоплююча командна граБаскетбол - це захоплююча командна гра, яка вимагає навичок, спритності та співпраці. Для тих, хто тільки починає вивчати баскетбол, освоєння основ - перший крок до успішної гри.Баскетбол - це захоплююча командна граБаскетбол - це захоплююча командна гра, яка вимагає навичок, спритності та співпраці. Для тих, хто тільки починає вивчати баскетбол, освоєння основ - перший крок до успішної гри.Баскетбол - це захоплююча командна граБаскетбол - це захоплююча командна гра, яка вимагає навичок, спритності та співпраці. Для тих, хто тільки починає вивчати баскетбол, освоєння основ - перший крок до успішної гри.Баскетбол - це захоплююча командна граБаскетбол - це захоплююча командна гра, яка вимагає навичок, спритності та співпраці. Для тих, хто тільки починає вивчати баскетбол, освоєння основ - перший крок до успішної гри.Баскетбол - це захоплююча командна граБаскетбол - це захоплююча командна гра, яка вимагає навичок, спритності та співпраці. Для тих, хто тільки починає вивчати баскетбол, освоєння основ - перший крок до успішної гри.Баскетбол - це захоплююча командна граБаскетбол - це захоплююча командна гра, яка вимагає навичок, спритності та співпраці. Для тих, хто тільки починає вивчати баскетбол, освоєння основ - перший крок до успішної гри.Баскетбол - це захоплююча командна граБаскетбол - це захоплююча командна гра, яка вимагає навичок, спритності та співпраці. Для тих, хто тільки починає вивчати баскетбол, освоєння основ - перший крок до успішної гри.Баскетбол - це захоплююча командна граБаскетбол - це захоплююча командна гра, яка вимагає навичок, спритності та співпраці. Для тих, хто тільки починає вивчати баскетбол, освоєння основ - перший крок до успішної гри.Баскетбол - це захоплююча командна граБаскетбол - це захоплююча командна гра, яка вимагає навичок, спритності та співпраці. Для тих, хто тільки починає вивчати баскетбол, освоєння основ - перший крок до успішної гри.Баскетбол - це захоплююча командна граБаскетбол - це захоплююча командна гра, яка вимагає навичок, спритності та співпраці. Для тих, хто тільки починає вивчати баскетбол, освоєння основ - перший крок до успішної гри.Баскетбол - це захоплююча командна граБаскетбол - це захоплююча командна гра, яка вимагає навичок, спритності та співпраці. Для тих, хто тільки починає вивчати баскетбол, освоєння основ - перший крок до успішної гри.Баскетбол - це захоплююча командна граБаскетбол - це захоплююча командна гра, яка вимагає навичок, спритності та співпраці. Для тих, хто тільки починає вивчати баскетбол, освоєння основ - перший крок до успішної гри.Баскетбол - це захоплююча командна граБаскетбол - це захоплююча командна гра, яка вимагає навичок, спритності та співпраці. Для тих, хто тільки починає вивчати баскетбол, освоєння основ - перший крок до успішної гри.Баскетбол - це захоплююча командна граБаскетбол - це захоплююча командна гра, яка вимагає навичок, спритності та співпраці. Для тих, хто тільки починає вивчати баскетбол, освоєння основ - перший крок до успішної гри.Баскетбол - це захоплююча командна гра',
    image: 'img/blog/blog2.jpg',
  },
];

function ReadsBlock() {
  return (
    <section className="reads">
        <div className="container">
            <div className="reads-block">
                {readsData.map((article) => (
                    <Reads
                    title={article.title}
                    description={article.description}
                    image={article.image}
                    articleId={article.id}
                    />
                ))}
            </div>
        </div>
    </section>
  );
}

export { readsData };
export default ReadsBlock;